blog.org
#+title: Vuri's blog
#+author: vuri

#+hugo_auto_set_lastmod: t
#+hugo_base_dir: .
#+hugo_section: .

#+options: toc:2

** TODO The hardway to Rust
:properties:
:export_file_name: the-hardway-to-rust
:end:

*** 00-Setup
**** Install

=rustup= 是 Rust 的安装程序，通过下面这个方式进行安装:

#+begin_src shell
  $ curl --proto '=https' --tlsv1.2 https://sh.rustup.rs -sSf | sh

  $ rustup -V
  rustup 1.26.0 (5af9b9484 2023-04-05)
  info: This is the version for the rustup toolchain manager, not the rustc compiler.
  info: The currently active `rustc` version is `rustc 1.73.0 (cc66ad468 2023-10-03)`

  $ rustc -V
  rustc 1.73.0 (cc66ad468 2023-10-03)

  $ cargo -V
  cargo 1.73.0 (9c4383fb5 2023-08-26)
#+end_src

如何进行版本更新:

#+begin_src shell
  $ rustup update
#+end_src

执行 =rustup doc= 打开本地文档

**** Emacs/Spacemacs

在 Emacs/Spacemacs 上进行环境配置，启用 =Rust layer= ：

#+begin_src emacs-lisp
  (dotspacemacs-configuration-layers
   '(
     (rust :variables
           rustic-format-on-save t))
  )
#+end_src

**** 配置 rust-analyzer

=rust-analyzer= 是 =Rust= 的 =LSP(Language Server Protocol)= 的实现，提供自动补全、跳转等功能。

#+begin_src shell
  $ brew install rust-analyzer
#+end_src

*** 01-Hello world

创建工程目录 =l01-hello-world=

#+begin_src shell
  $ mkdir l01-hello-world && cd l01-hello-world && touch main.rs
#+end_src

添加 =main.rs= 文件并保存如下内容：

#+begin_src rust
  fn main() {
      println!("Hello world!");
  }
#+end_src

#+begin_src shell
  $ rustc main.rs
  $ ./main
  Hello world!
#+end_src

*** 02-Hello Cargo

#+begin_src shell
  # 创建工程
  $ cargo new l02-hello-cargo

  $ tree -L 2 l02-hello-cargo
  l02-hello-cargo
  ├── Cargo.lock
  ├── Cargo.toml
  ├── README.md
  ├── src
  │   └── main.rs
  └── target

  # 执行程序
  $ cd l02-hello-cargo
  $ cargo run
  Compiling l02-hello-cargo v0.1.0
  Finished dev [unoptimized + debuginfo] target(s) in 0.56s
  Running `target/debug/l02-hello-cargo`
  Hello, world!

  # 等价于
  $ cargo build
  $ ./target/debug/l02-hello-cargo
  Hello, world!

  # 在 release 模式下，采用编译优化
  $ cargo run --release
  $ cargo build --release
#+end_src
